sownlee/MCAL/env/STM32F407VG/header/Header_NVIC.h
#if !defined(HEADER_NVIC_H_) 
#define HEADER_NVIC_H_

#include "Header.h"


#define NVIC_ISER_COUNT                      8u
#define NVIC_ICER_COUNT                      8u
#define NVIC_ISPR_COUNT                      8u
#define NVIC_ICPR_COUNT                      8u
#define NVIC_IABR_COUNT                      8u
#define NVIC_IP_COUNT                        240u

typedef struct {
  __IO uint32_t ISER[NVIC_ISER_COUNT];         /* Interrupt Set Enable Register n, array offset: 0x0, array step: 0x4 */
       uint8_t RESERVED_0[96];
  __IO uint32_t ICER[NVIC_ICER_COUNT];         /* Interrupt Clear Enable Register n, array offset: 0x80, array step: 0x4 */
       uint8_t RESERVED_1[96];
  __IO uint32_t ISPR[NVIC_ISPR_COUNT];         /* Interrupt Set Pending Register n, array offset: 0x100, array step: 0x4 */
       uint8_t RESERVED_2[96];
  __IO uint32_t ICPR[NVIC_ICPR_COUNT];         /* Interrupt Clear Pending Register n, array offset: 0x180, array step: 0x4 */
       uint8_t RESERVED_3[96];
  __IO uint32_t IABR[NVIC_IABR_COUNT];         /* Interrupt Active bit Register n, array offset: 0x200, array step: 0x4 */
       uint8_t RESERVED_4[224];
  __IO uint8_t IP[NVIC_IP_COUNT];              /* Interrupt Priority Register n, array offset: 0x300, array step: 0x1 */
       uint8_t RESERVED_5[2576];
  __O  uint32_t STIR;                          /* Software Trigger Interrupt Register, offset: 0xE00 */
} NVIC_Type;

 /* Number of instances of the NVIC module. */
#define NVIC_INSTANCE_COUNT                  (1u)
/* Peripheral NVIC base pointer */
#define NVIC                                 ((NVIC_Type *)NVIC_BASE)
/* Array initializer of NVIC peripheral base pointers */
#define NVIC_BASE_PTRS                       { NVIC }
 /* Number of interrupt vector arrays for the NVIC module. */
#define NVIC_IRQS_ARR_COUNT                  (1u)
 /* Number of interrupt channels for the NVIC module. */
#define NVIC_IRQS_CH_COUNT                   (1u)

/*NVIC ISERx core*/ 
#define NVIC_ISER0 ((__O uint32_t *)0xE000E100)
#define NVIC_ISER1 ((__O uint32_t *)0xE000E104)
#define NVIC_ISER2 ((__O uint32_t *)0xE000E108)
#define NVIC_ISER3 ((__O uint32_t *)0xE000E10C)
/*NVIC ICERx core*/ 
#define NVIC_ICER0 ((__O uint32_t *)0xE000E180)
#define NVIC_ICER1 ((__O uint32_t *)0xE000E184)
#define NVIC_ICER2 ((__O uint32_t *)0xE000E188)
#define NVIC_ICER3 ((__O uint32_t *)0xE000E18C)
/*NVIC priority core*/ 
#define NVIC_PR_BASE_ADDR ((__O uint32_t *)0xE000E400)

/* Number of priority bits implemented in Priority Register in ARM */
#define NO_PR_BITS_IMPLEMENTED 4


/* ISER Bit Fields */
#define NVIC_ISER_SETENA_MASK                0xFFFFFFFFu
#define NVIC_ISER_SETENA_SHIFT               0u
#define NVIC_ISER_SETENA_WIDTH               32u
#define NVIC_ISER_SETENA(x)                  (((uint32_t)(((uint32_t)(x))<<NVIC_ISER_SETENA_SHIFT))&NVIC_ISER_SETENA_MASK)
/* ICER Bit Fields */
#define NVIC_ICER_CLRENA_MASK                0xFFFFFFFFu
#define NVIC_ICER_CLRENA_SHIFT               0u
#define NVIC_ICER_CLRENA_WIDTH               32u
#define NVIC_ICER_CLRENA(x)                  (((uint32_t)(((uint32_t)(x))<<NVIC_ICER_CLRENA_SHIFT))&NVIC_ICER_CLRENA_MASK)
/* ISPR Bit Fields */
#define NVIC_ISPR_SETPEND_MASK               0xFFFFFFFFu
#define NVIC_ISPR_SETPEND_SHIFT              0u
#define NVIC_ISPR_SETPEND_WIDTH              32u
#define NVIC_ISPR_SETPEND(x)                 (((uint32_t)(((uint32_t)(x))<<NVIC_ISPR_SETPEND_SHIFT))&NVIC_ISPR_SETPEND_MASK)
/* ICPR Bit Fields */
#define NVIC_ICPR_CLRPEND_MASK               0xFFFFFFFFu
#define NVIC_ICPR_CLRPEND_SHIFT              0u
#define NVIC_ICPR_CLRPEND_WIDTH              32u
#define NVIC_ICPR_CLRPEND(x)                 (((uint32_t)(((uint32_t)(x))<<NVIC_ICPR_CLRPEND_SHIFT))&NVIC_ICPR_CLRPEND_MASK)
/* IABR Bit Fields */
#define NVIC_IABR_ACTIVE_MASK                0xFFFFFFFFu
#define NVIC_IABR_ACTIVE_SHIFT               0u
#define NVIC_IABR_ACTIVE_WIDTH               32u
#define NVIC_IABR_ACTIVE(x)                  (((uint32_t)(((uint32_t)(x))<<NVIC_IABR_ACTIVE_SHIFT))&NVIC_IABR_ACTIVE_MASK)
/* IP Bit Fields */
#define NVIC_IP_PRI0_MASK                    0xFFu
#define NVIC_IP_PRI0_SHIFT                   0u
#define NVIC_IP_PRI0_WIDTH                   8u
#define NVIC_IP_PRI0(x)                      (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI0_SHIFT))&NVIC_IP_PRI0_MASK)
#define NVIC_IP_PRI1_MASK                    0xFFu
#define NVIC_IP_PRI1_SHIFT                   0u
#define NVIC_IP_PRI1_WIDTH                   8u
#define NVIC_IP_PRI1(x)                      (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI1_SHIFT))&NVIC_IP_PRI1_MASK)
#define NVIC_IP_PRI2_MASK                    0xFFu
#define NVIC_IP_PRI2_SHIFT                   0u
#define NVIC_IP_PRI2_WIDTH                   8u
#define NVIC_IP_PRI2(x)                      (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI2_SHIFT))&NVIC_IP_PRI2_MASK)
#define NVIC_IP_PRI3_MASK                    0xFFu
#define NVIC_IP_PRI3_SHIFT                   0u
#define NVIC_IP_PRI3_WIDTH                   8u
#define NVIC_IP_PRI3(x)                      (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI3_SHIFT))&NVIC_IP_PRI3_MASK)
#define NVIC_IP_PRI4_MASK                    0xFFu
#define NVIC_IP_PRI4_SHIFT                   0u
#define NVIC_IP_PRI4_WIDTH                   8u
#define NVIC_IP_PRI4(x)                      (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI4_SHIFT))&NVIC_IP_PRI4_MASK)
#define NVIC_IP_PRI5_MASK                    0xFFu
#define NVIC_IP_PRI5_SHIFT                   0u
#define NVIC_IP_PRI5_WIDTH                   8u
#define NVIC_IP_PRI5(x)                      (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI5_SHIFT))&NVIC_IP_PRI5_MASK)
#define NVIC_IP_PRI6_MASK                    0xFFu
#define NVIC_IP_PRI6_SHIFT                   0u
#define NVIC_IP_PRI6_WIDTH                   8u
#define NVIC_IP_PRI6(x)                      (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI6_SHIFT))&NVIC_IP_PRI6_MASK)
#define NVIC_IP_PRI7_MASK                    0xFFu
#define NVIC_IP_PRI7_SHIFT                   0u
#define NVIC_IP_PRI7_WIDTH                   8u
#define NVIC_IP_PRI7(x)                      (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI7_SHIFT))&NVIC_IP_PRI7_MASK)
#define NVIC_IP_PRI8_MASK                    0xFFu
#define NVIC_IP_PRI8_SHIFT                   0u
#define NVIC_IP_PRI8_WIDTH                   8u
#define NVIC_IP_PRI8(x)                      (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI8_SHIFT))&NVIC_IP_PRI8_MASK)
#define NVIC_IP_PRI9_MASK                    0xFFu
#define NVIC_IP_PRI9_SHIFT                   0u
#define NVIC_IP_PRI9_WIDTH                   8u
#define NVIC_IP_PRI9(x)                      (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI9_SHIFT))&NVIC_IP_PRI9_MASK)
#define NVIC_IP_PRI10_MASK                   0xFFu
#define NVIC_IP_PRI10_SHIFT                  0u
#define NVIC_IP_PRI10_WIDTH                  8u
#define NVIC_IP_PRI10(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI10_SHIFT))&NVIC_IP_PRI10_MASK)
#define NVIC_IP_PRI11_MASK                   0xFFu
#define NVIC_IP_PRI11_SHIFT                  0u
#define NVIC_IP_PRI11_WIDTH                  8u
#define NVIC_IP_PRI11(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI11_SHIFT))&NVIC_IP_PRI11_MASK)
#define NVIC_IP_PRI12_MASK                   0xFFu
#define NVIC_IP_PRI12_SHIFT                  0u
#define NVIC_IP_PRI12_WIDTH                  8u
#define NVIC_IP_PRI12(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI12_SHIFT))&NVIC_IP_PRI12_MASK)
#define NVIC_IP_PRI13_MASK                   0xFFu
#define NVIC_IP_PRI13_SHIFT                  0u
#define NVIC_IP_PRI13_WIDTH                  8u
#define NVIC_IP_PRI13(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI13_SHIFT))&NVIC_IP_PRI13_MASK)
#define NVIC_IP_PRI14_MASK                   0xFFu
#define NVIC_IP_PRI14_SHIFT                  0u
#define NVIC_IP_PRI14_WIDTH                  8u
#define NVIC_IP_PRI14(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI14_SHIFT))&NVIC_IP_PRI14_MASK)
#define NVIC_IP_PRI15_MASK                   0xFFu
#define NVIC_IP_PRI15_SHIFT                  0u
#define NVIC_IP_PRI15_WIDTH                  8u
#define NVIC_IP_PRI15(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI15_SHIFT))&NVIC_IP_PRI15_MASK)
#define NVIC_IP_PRI16_MASK                   0xFFu
#define NVIC_IP_PRI16_SHIFT                  0u
#define NVIC_IP_PRI16_WIDTH                  8u
#define NVIC_IP_PRI16(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI16_SHIFT))&NVIC_IP_PRI16_MASK)
#define NVIC_IP_PRI17_MASK                   0xFFu
#define NVIC_IP_PRI17_SHIFT                  0u
#define NVIC_IP_PRI17_WIDTH                  8u
#define NVIC_IP_PRI17(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI17_SHIFT))&NVIC_IP_PRI17_MASK)
#define NVIC_IP_PRI18_MASK                   0xFFu
#define NVIC_IP_PRI18_SHIFT                  0u
#define NVIC_IP_PRI18_WIDTH                  8u
#define NVIC_IP_PRI18(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI18_SHIFT))&NVIC_IP_PRI18_MASK)
#define NVIC_IP_PRI19_MASK                   0xFFu
#define NVIC_IP_PRI19_SHIFT                  0u
#define NVIC_IP_PRI19_WIDTH                  8u
#define NVIC_IP_PRI19(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI19_SHIFT))&NVIC_IP_PRI19_MASK)
#define NVIC_IP_PRI20_MASK                   0xFFu
#define NVIC_IP_PRI20_SHIFT                  0u
#define NVIC_IP_PRI20_WIDTH                  8u
#define NVIC_IP_PRI20(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI20_SHIFT))&NVIC_IP_PRI20_MASK)
#define NVIC_IP_PRI21_MASK                   0xFFu
#define NVIC_IP_PRI21_SHIFT                  0u
#define NVIC_IP_PRI21_WIDTH                  8u
#define NVIC_IP_PRI21(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI21_SHIFT))&NVIC_IP_PRI21_MASK)
#define NVIC_IP_PRI22_MASK                   0xFFu
#define NVIC_IP_PRI22_SHIFT                  0u
#define NVIC_IP_PRI22_WIDTH                  8u
#define NVIC_IP_PRI22(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI22_SHIFT))&NVIC_IP_PRI22_MASK)
#define NVIC_IP_PRI23_MASK                   0xFFu
#define NVIC_IP_PRI23_SHIFT                  0u
#define NVIC_IP_PRI23_WIDTH                  8u
#define NVIC_IP_PRI23(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI23_SHIFT))&NVIC_IP_PRI23_MASK)
#define NVIC_IP_PRI24_MASK                   0xFFu
#define NVIC_IP_PRI24_SHIFT                  0u
#define NVIC_IP_PRI24_WIDTH                  8u
#define NVIC_IP_PRI24(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI24_SHIFT))&NVIC_IP_PRI24_MASK)
#define NVIC_IP_PRI25_MASK                   0xFFu
#define NVIC_IP_PRI25_SHIFT                  0u
#define NVIC_IP_PRI25_WIDTH                  8u
#define NVIC_IP_PRI25(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI25_SHIFT))&NVIC_IP_PRI25_MASK)
#define NVIC_IP_PRI26_MASK                   0xFFu
#define NVIC_IP_PRI26_SHIFT                  0u
#define NVIC_IP_PRI26_WIDTH                  8u
#define NVIC_IP_PRI26(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI26_SHIFT))&NVIC_IP_PRI26_MASK)
#define NVIC_IP_PRI27_MASK                   0xFFu
#define NVIC_IP_PRI27_SHIFT                  0u
#define NVIC_IP_PRI27_WIDTH                  8u
#define NVIC_IP_PRI27(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI27_SHIFT))&NVIC_IP_PRI27_MASK)
#define NVIC_IP_PRI28_MASK                   0xFFu
#define NVIC_IP_PRI28_SHIFT                  0u
#define NVIC_IP_PRI28_WIDTH                  8u
#define NVIC_IP_PRI28(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI28_SHIFT))&NVIC_IP_PRI28_MASK)
#define NVIC_IP_PRI29_MASK                   0xFFu
#define NVIC_IP_PRI29_SHIFT                  0u
#define NVIC_IP_PRI29_WIDTH                  8u
#define NVIC_IP_PRI29(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI29_SHIFT))&NVIC_IP_PRI29_MASK)
#define NVIC_IP_PRI30_MASK                   0xFFu
#define NVIC_IP_PRI30_SHIFT                  0u
#define NVIC_IP_PRI30_WIDTH                  8u
#define NVIC_IP_PRI30(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI30_SHIFT))&NVIC_IP_PRI30_MASK)
#define NVIC_IP_PRI31_MASK                   0xFFu
#define NVIC_IP_PRI31_SHIFT                  0u
#define NVIC_IP_PRI31_WIDTH                  8u
#define NVIC_IP_PRI31(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI31_SHIFT))&NVIC_IP_PRI31_MASK)
#define NVIC_IP_PRI32_MASK                   0xFFu
#define NVIC_IP_PRI32_SHIFT                  0u
#define NVIC_IP_PRI32_WIDTH                  8u
#define NVIC_IP_PRI32(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI32_SHIFT))&NVIC_IP_PRI32_MASK)
#define NVIC_IP_PRI33_MASK                   0xFFu
#define NVIC_IP_PRI33_SHIFT                  0u
#define NVIC_IP_PRI33_WIDTH                  8u
#define NVIC_IP_PRI33(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI33_SHIFT))&NVIC_IP_PRI33_MASK)
#define NVIC_IP_PRI34_MASK                   0xFFu
#define NVIC_IP_PRI34_SHIFT                  0u
#define NVIC_IP_PRI34_WIDTH                  8u
#define NVIC_IP_PRI34(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI34_SHIFT))&NVIC_IP_PRI34_MASK)
#define NVIC_IP_PRI35_MASK                   0xFFu
#define NVIC_IP_PRI35_SHIFT                  0u
#define NVIC_IP_PRI35_WIDTH                  8u
#define NVIC_IP_PRI35(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI35_SHIFT))&NVIC_IP_PRI35_MASK)
#define NVIC_IP_PRI36_MASK                   0xFFu
#define NVIC_IP_PRI36_SHIFT                  0u
#define NVIC_IP_PRI36_WIDTH                  8u
#define NVIC_IP_PRI36(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI36_SHIFT))&NVIC_IP_PRI36_MASK)
#define NVIC_IP_PRI37_MASK                   0xFFu
#define NVIC_IP_PRI37_SHIFT                  0u
#define NVIC_IP_PRI37_WIDTH                  8u
#define NVIC_IP_PRI37(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI37_SHIFT))&NVIC_IP_PRI37_MASK)
#define NVIC_IP_PRI38_MASK                   0xFFu
#define NVIC_IP_PRI38_SHIFT                  0u
#define NVIC_IP_PRI38_WIDTH                  8u
#define NVIC_IP_PRI38(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI38_SHIFT))&NVIC_IP_PRI38_MASK)
#define NVIC_IP_PRI39_MASK                   0xFFu
#define NVIC_IP_PRI39_SHIFT                  0u
#define NVIC_IP_PRI39_WIDTH                  8u
#define NVIC_IP_PRI39(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI39_SHIFT))&NVIC_IP_PRI39_MASK)
#define NVIC_IP_PRI40_MASK                   0xFFu
#define NVIC_IP_PRI40_SHIFT                  0u
#define NVIC_IP_PRI40_WIDTH                  8u
#define NVIC_IP_PRI40(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI40_SHIFT))&NVIC_IP_PRI40_MASK)
#define NVIC_IP_PRI41_MASK                   0xFFu
#define NVIC_IP_PRI41_SHIFT                  0u
#define NVIC_IP_PRI41_WIDTH                  8u
#define NVIC_IP_PRI41(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI41_SHIFT))&NVIC_IP_PRI41_MASK)
#define NVIC_IP_PRI42_MASK                   0xFFu
#define NVIC_IP_PRI42_SHIFT                  0u
#define NVIC_IP_PRI42_WIDTH                  8u
#define NVIC_IP_PRI42(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI42_SHIFT))&NVIC_IP_PRI42_MASK)
#define NVIC_IP_PRI43_MASK                   0xFFu
#define NVIC_IP_PRI43_SHIFT                  0u
#define NVIC_IP_PRI43_WIDTH                  8u
#define NVIC_IP_PRI43(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI43_SHIFT))&NVIC_IP_PRI43_MASK)
#define NVIC_IP_PRI44_MASK                   0xFFu
#define NVIC_IP_PRI44_SHIFT                  0u
#define NVIC_IP_PRI44_WIDTH                  8u
#define NVIC_IP_PRI44(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI44_SHIFT))&NVIC_IP_PRI44_MASK)
#define NVIC_IP_PRI45_MASK                   0xFFu
#define NVIC_IP_PRI45_SHIFT                  0u
#define NVIC_IP_PRI45_WIDTH                  8u
#define NVIC_IP_PRI45(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI45_SHIFT))&NVIC_IP_PRI45_MASK)
#define NVIC_IP_PRI46_MASK                   0xFFu
#define NVIC_IP_PRI46_SHIFT                  0u
#define NVIC_IP_PRI46_WIDTH                  8u
#define NVIC_IP_PRI46(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI46_SHIFT))&NVIC_IP_PRI46_MASK)
#define NVIC_IP_PRI47_MASK                   0xFFu
#define NVIC_IP_PRI47_SHIFT                  0u
#define NVIC_IP_PRI47_WIDTH                  8u
#define NVIC_IP_PRI47(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI47_SHIFT))&NVIC_IP_PRI47_MASK)
#define NVIC_IP_PRI48_MASK                   0xFFu
#define NVIC_IP_PRI48_SHIFT                  0u
#define NVIC_IP_PRI48_WIDTH                  8u
#define NVIC_IP_PRI48(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI48_SHIFT))&NVIC_IP_PRI48_MASK)
#define NVIC_IP_PRI49_MASK                   0xFFu
#define NVIC_IP_PRI49_SHIFT                  0u
#define NVIC_IP_PRI49_WIDTH                  8u
#define NVIC_IP_PRI49(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI49_SHIFT))&NVIC_IP_PRI49_MASK)
#define NVIC_IP_PRI50_MASK                   0xFFu
#define NVIC_IP_PRI50_SHIFT                  0u
#define NVIC_IP_PRI50_WIDTH                  8u
#define NVIC_IP_PRI50(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI50_SHIFT))&NVIC_IP_PRI50_MASK)
#define NVIC_IP_PRI51_MASK                   0xFFu
#define NVIC_IP_PRI51_SHIFT                  0u
#define NVIC_IP_PRI51_WIDTH                  8u
#define NVIC_IP_PRI51(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI51_SHIFT))&NVIC_IP_PRI51_MASK)
#define NVIC_IP_PRI52_MASK                   0xFFu
#define NVIC_IP_PRI52_SHIFT                  0u
#define NVIC_IP_PRI52_WIDTH                  8u
#define NVIC_IP_PRI52(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI52_SHIFT))&NVIC_IP_PRI52_MASK)
#define NVIC_IP_PRI53_MASK                   0xFFu
#define NVIC_IP_PRI53_SHIFT                  0u
#define NVIC_IP_PRI53_WIDTH                  8u
#define NVIC_IP_PRI53(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI53_SHIFT))&NVIC_IP_PRI53_MASK)
#define NVIC_IP_PRI54_MASK                   0xFFu
#define NVIC_IP_PRI54_SHIFT                  0u
#define NVIC_IP_PRI54_WIDTH                  8u
#define NVIC_IP_PRI54(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI54_SHIFT))&NVIC_IP_PRI54_MASK)
#define NVIC_IP_PRI55_MASK                   0xFFu
#define NVIC_IP_PRI55_SHIFT                  0u
#define NVIC_IP_PRI55_WIDTH                  8u
#define NVIC_IP_PRI55(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI55_SHIFT))&NVIC_IP_PRI55_MASK)
#define NVIC_IP_PRI56_MASK                   0xFFu
#define NVIC_IP_PRI56_SHIFT                  0u
#define NVIC_IP_PRI56_WIDTH                  8u
#define NVIC_IP_PRI56(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI56_SHIFT))&NVIC_IP_PRI56_MASK)
#define NVIC_IP_PRI57_MASK                   0xFFu
#define NVIC_IP_PRI57_SHIFT                  0u
#define NVIC_IP_PRI57_WIDTH                  8u
#define NVIC_IP_PRI57(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI57_SHIFT))&NVIC_IP_PRI57_MASK)
#define NVIC_IP_PRI58_MASK                   0xFFu
#define NVIC_IP_PRI58_SHIFT                  0u
#define NVIC_IP_PRI58_WIDTH                  8u
#define NVIC_IP_PRI58(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI58_SHIFT))&NVIC_IP_PRI58_MASK)
#define NVIC_IP_PRI59_MASK                   0xFFu
#define NVIC_IP_PRI59_SHIFT                  0u
#define NVIC_IP_PRI59_WIDTH                  8u
#define NVIC_IP_PRI59(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI59_SHIFT))&NVIC_IP_PRI59_MASK)
#define NVIC_IP_PRI60_MASK                   0xFFu
#define NVIC_IP_PRI60_SHIFT                  0u
#define NVIC_IP_PRI60_WIDTH                  8u
#define NVIC_IP_PRI60(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI60_SHIFT))&NVIC_IP_PRI60_MASK)
#define NVIC_IP_PRI61_MASK                   0xFFu
#define NVIC_IP_PRI61_SHIFT                  0u
#define NVIC_IP_PRI61_WIDTH                  8u
#define NVIC_IP_PRI61(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI61_SHIFT))&NVIC_IP_PRI61_MASK)
#define NVIC_IP_PRI62_MASK                   0xFFu
#define NVIC_IP_PRI62_SHIFT                  0u
#define NVIC_IP_PRI62_WIDTH                  8u
#define NVIC_IP_PRI62(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI62_SHIFT))&NVIC_IP_PRI62_MASK)
#define NVIC_IP_PRI63_MASK                   0xFFu
#define NVIC_IP_PRI63_SHIFT                  0u
#define NVIC_IP_PRI63_WIDTH                  8u
#define NVIC_IP_PRI63(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI63_SHIFT))&NVIC_IP_PRI63_MASK)
#define NVIC_IP_PRI64_MASK                   0xFFu
#define NVIC_IP_PRI64_SHIFT                  0u
#define NVIC_IP_PRI64_WIDTH                  8u
#define NVIC_IP_PRI64(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI64_SHIFT))&NVIC_IP_PRI64_MASK)
#define NVIC_IP_PRI65_MASK                   0xFFu
#define NVIC_IP_PRI65_SHIFT                  0u
#define NVIC_IP_PRI65_WIDTH                  8u
#define NVIC_IP_PRI65(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI65_SHIFT))&NVIC_IP_PRI65_MASK)
#define NVIC_IP_PRI66_MASK                   0xFFu
#define NVIC_IP_PRI66_SHIFT                  0u
#define NVIC_IP_PRI66_WIDTH                  8u
#define NVIC_IP_PRI66(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI66_SHIFT))&NVIC_IP_PRI66_MASK)
#define NVIC_IP_PRI67_MASK                   0xFFu
#define NVIC_IP_PRI67_SHIFT                  0u
#define NVIC_IP_PRI67_WIDTH                  8u
#define NVIC_IP_PRI67(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI67_SHIFT))&NVIC_IP_PRI67_MASK)
#define NVIC_IP_PRI68_MASK                   0xFFu
#define NVIC_IP_PRI68_SHIFT                  0u
#define NVIC_IP_PRI68_WIDTH                  8u
#define NVIC_IP_PRI68(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI68_SHIFT))&NVIC_IP_PRI68_MASK)
#define NVIC_IP_PRI69_MASK                   0xFFu
#define NVIC_IP_PRI69_SHIFT                  0u
#define NVIC_IP_PRI69_WIDTH                  8u
#define NVIC_IP_PRI69(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI69_SHIFT))&NVIC_IP_PRI69_MASK)
#define NVIC_IP_PRI70_MASK                   0xFFu
#define NVIC_IP_PRI70_SHIFT                  0u
#define NVIC_IP_PRI70_WIDTH                  8u
#define NVIC_IP_PRI70(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI70_SHIFT))&NVIC_IP_PRI70_MASK)
#define NVIC_IP_PRI71_MASK                   0xFFu
#define NVIC_IP_PRI71_SHIFT                  0u
#define NVIC_IP_PRI71_WIDTH                  8u
#define NVIC_IP_PRI71(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI71_SHIFT))&NVIC_IP_PRI71_MASK)
#define NVIC_IP_PRI72_MASK                   0xFFu
#define NVIC_IP_PRI72_SHIFT                  0u
#define NVIC_IP_PRI72_WIDTH                  8u
#define NVIC_IP_PRI72(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI72_SHIFT))&NVIC_IP_PRI72_MASK)
#define NVIC_IP_PRI73_MASK                   0xFFu
#define NVIC_IP_PRI73_SHIFT                  0u
#define NVIC_IP_PRI73_WIDTH                  8u
#define NVIC_IP_PRI73(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI73_SHIFT))&NVIC_IP_PRI73_MASK)
#define NVIC_IP_PRI74_MASK                   0xFFu
#define NVIC_IP_PRI74_SHIFT                  0u
#define NVIC_IP_PRI74_WIDTH                  8u
#define NVIC_IP_PRI74(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI74_SHIFT))&NVIC_IP_PRI74_MASK)
#define NVIC_IP_PRI75_MASK                   0xFFu
#define NVIC_IP_PRI75_SHIFT                  0u
#define NVIC_IP_PRI75_WIDTH                  8u
#define NVIC_IP_PRI75(x)                     (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI75_SHIFT))&NVIC_IP_PRI75_MASK)
