sownlee/MCAL/env/STM32F407VG/header/Header_NVIC.h
#define NVIC_IP_PRI167_MASK                  0xFFu
#define NVIC_IP_PRI167_SHIFT                 0u
#define NVIC_IP_PRI167_WIDTH                 8u
#define NVIC_IP_PRI167(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI167_SHIFT))&NVIC_IP_PRI167_MASK)
#define NVIC_IP_PRI168_MASK                  0xFFu
#define NVIC_IP_PRI168_SHIFT                 0u
#define NVIC_IP_PRI168_WIDTH                 8u
#define NVIC_IP_PRI168(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI168_SHIFT))&NVIC_IP_PRI168_MASK)
#define NVIC_IP_PRI169_MASK                  0xFFu
#define NVIC_IP_PRI169_SHIFT                 0u
#define NVIC_IP_PRI169_WIDTH                 8u
#define NVIC_IP_PRI169(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI169_SHIFT))&NVIC_IP_PRI169_MASK)
#define NVIC_IP_PRI170_MASK                  0xFFu
#define NVIC_IP_PRI170_SHIFT                 0u
#define NVIC_IP_PRI170_WIDTH                 8u
#define NVIC_IP_PRI170(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI170_SHIFT))&NVIC_IP_PRI170_MASK)
#define NVIC_IP_PRI171_MASK                  0xFFu
#define NVIC_IP_PRI171_SHIFT                 0u
#define NVIC_IP_PRI171_WIDTH                 8u
#define NVIC_IP_PRI171(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI171_SHIFT))&NVIC_IP_PRI171_MASK)
#define NVIC_IP_PRI172_MASK                  0xFFu
#define NVIC_IP_PRI172_SHIFT                 0u
#define NVIC_IP_PRI172_WIDTH                 8u
#define NVIC_IP_PRI172(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI172_SHIFT))&NVIC_IP_PRI172_MASK)
#define NVIC_IP_PRI173_MASK                  0xFFu
#define NVIC_IP_PRI173_SHIFT                 0u
#define NVIC_IP_PRI173_WIDTH                 8u
#define NVIC_IP_PRI173(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI173_SHIFT))&NVIC_IP_PRI173_MASK)
#define NVIC_IP_PRI174_MASK                  0xFFu
#define NVIC_IP_PRI174_SHIFT                 0u
#define NVIC_IP_PRI174_WIDTH                 8u
#define NVIC_IP_PRI174(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI174_SHIFT))&NVIC_IP_PRI174_MASK)
#define NVIC_IP_PRI175_MASK                  0xFFu
#define NVIC_IP_PRI175_SHIFT                 0u
#define NVIC_IP_PRI175_WIDTH                 8u
#define NVIC_IP_PRI175(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI175_SHIFT))&NVIC_IP_PRI175_MASK)
#define NVIC_IP_PRI176_MASK                  0xFFu
#define NVIC_IP_PRI176_SHIFT                 0u
#define NVIC_IP_PRI176_WIDTH                 8u
#define NVIC_IP_PRI176(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI176_SHIFT))&NVIC_IP_PRI176_MASK)
#define NVIC_IP_PRI177_MASK                  0xFFu
#define NVIC_IP_PRI177_SHIFT                 0u
#define NVIC_IP_PRI177_WIDTH                 8u
#define NVIC_IP_PRI177(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI177_SHIFT))&NVIC_IP_PRI177_MASK)
#define NVIC_IP_PRI178_MASK                  0xFFu
#define NVIC_IP_PRI178_SHIFT                 0u
#define NVIC_IP_PRI178_WIDTH                 8u
#define NVIC_IP_PRI178(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI178_SHIFT))&NVIC_IP_PRI178_MASK)
#define NVIC_IP_PRI179_MASK                  0xFFu
#define NVIC_IP_PRI179_SHIFT                 0u
#define NVIC_IP_PRI179_WIDTH                 8u
#define NVIC_IP_PRI179(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI179_SHIFT))&NVIC_IP_PRI179_MASK)
#define NVIC_IP_PRI180_MASK                  0xFFu
#define NVIC_IP_PRI180_SHIFT                 0u
#define NVIC_IP_PRI180_WIDTH                 8u
#define NVIC_IP_PRI180(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI180_SHIFT))&NVIC_IP_PRI180_MASK)
#define NVIC_IP_PRI181_MASK                  0xFFu
#define NVIC_IP_PRI181_SHIFT                 0u
#define NVIC_IP_PRI181_WIDTH                 8u
#define NVIC_IP_PRI181(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI181_SHIFT))&NVIC_IP_PRI181_MASK)
#define NVIC_IP_PRI182_MASK                  0xFFu
#define NVIC_IP_PRI182_SHIFT                 0u
#define NVIC_IP_PRI182_WIDTH                 8u
#define NVIC_IP_PRI182(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI182_SHIFT))&NVIC_IP_PRI182_MASK)
#define NVIC_IP_PRI183_MASK                  0xFFu
#define NVIC_IP_PRI183_SHIFT                 0u
#define NVIC_IP_PRI183_WIDTH                 8u
#define NVIC_IP_PRI183(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI183_SHIFT))&NVIC_IP_PRI183_MASK)
#define NVIC_IP_PRI184_MASK                  0xFFu
#define NVIC_IP_PRI184_SHIFT                 0u
#define NVIC_IP_PRI184_WIDTH                 8u
#define NVIC_IP_PRI184(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI184_SHIFT))&NVIC_IP_PRI184_MASK)
#define NVIC_IP_PRI185_MASK                  0xFFu
#define NVIC_IP_PRI185_SHIFT                 0u
#define NVIC_IP_PRI185_WIDTH                 8u
#define NVIC_IP_PRI185(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI185_SHIFT))&NVIC_IP_PRI185_MASK)
#define NVIC_IP_PRI186_MASK                  0xFFu
#define NVIC_IP_PRI186_SHIFT                 0u
#define NVIC_IP_PRI186_WIDTH                 8u
#define NVIC_IP_PRI186(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI186_SHIFT))&NVIC_IP_PRI186_MASK)
#define NVIC_IP_PRI187_MASK                  0xFFu
#define NVIC_IP_PRI187_SHIFT                 0u
#define NVIC_IP_PRI187_WIDTH                 8u
#define NVIC_IP_PRI187(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI187_SHIFT))&NVIC_IP_PRI187_MASK)
#define NVIC_IP_PRI188_MASK                  0xFFu
#define NVIC_IP_PRI188_SHIFT                 0u
#define NVIC_IP_PRI188_WIDTH                 8u
#define NVIC_IP_PRI188(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI188_SHIFT))&NVIC_IP_PRI188_MASK)
#define NVIC_IP_PRI189_MASK                  0xFFu
#define NVIC_IP_PRI189_SHIFT                 0u
#define NVIC_IP_PRI189_WIDTH                 8u
#define NVIC_IP_PRI189(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI189_SHIFT))&NVIC_IP_PRI189_MASK)
#define NVIC_IP_PRI190_MASK                  0xFFu
#define NVIC_IP_PRI190_SHIFT                 0u
#define NVIC_IP_PRI190_WIDTH                 8u
#define NVIC_IP_PRI190(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI190_SHIFT))&NVIC_IP_PRI190_MASK)
#define NVIC_IP_PRI191_MASK                  0xFFu
#define NVIC_IP_PRI191_SHIFT                 0u
#define NVIC_IP_PRI191_WIDTH                 8u
#define NVIC_IP_PRI191(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI191_SHIFT))&NVIC_IP_PRI191_MASK)
#define NVIC_IP_PRI192_MASK                  0xFFu
#define NVIC_IP_PRI192_SHIFT                 0u
#define NVIC_IP_PRI192_WIDTH                 8u
#define NVIC_IP_PRI192(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI192_SHIFT))&NVIC_IP_PRI192_MASK)
#define NVIC_IP_PRI193_MASK                  0xFFu
#define NVIC_IP_PRI193_SHIFT                 0u
#define NVIC_IP_PRI193_WIDTH                 8u
#define NVIC_IP_PRI193(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI193_SHIFT))&NVIC_IP_PRI193_MASK)
#define NVIC_IP_PRI194_MASK                  0xFFu
#define NVIC_IP_PRI194_SHIFT                 0u
#define NVIC_IP_PRI194_WIDTH                 8u
#define NVIC_IP_PRI194(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI194_SHIFT))&NVIC_IP_PRI194_MASK)
#define NVIC_IP_PRI195_MASK                  0xFFu
#define NVIC_IP_PRI195_SHIFT                 0u
#define NVIC_IP_PRI195_WIDTH                 8u
#define NVIC_IP_PRI195(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI195_SHIFT))&NVIC_IP_PRI195_MASK)
#define NVIC_IP_PRI196_MASK                  0xFFu
#define NVIC_IP_PRI196_SHIFT                 0u
#define NVIC_IP_PRI196_WIDTH                 8u
#define NVIC_IP_PRI196(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI196_SHIFT))&NVIC_IP_PRI196_MASK)
#define NVIC_IP_PRI197_MASK                  0xFFu
#define NVIC_IP_PRI197_SHIFT                 0u
#define NVIC_IP_PRI197_WIDTH                 8u
#define NVIC_IP_PRI197(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI197_SHIFT))&NVIC_IP_PRI197_MASK)
#define NVIC_IP_PRI198_MASK                  0xFFu
#define NVIC_IP_PRI198_SHIFT                 0u
#define NVIC_IP_PRI198_WIDTH                 8u
#define NVIC_IP_PRI198(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI198_SHIFT))&NVIC_IP_PRI198_MASK)
#define NVIC_IP_PRI199_MASK                  0xFFu
#define NVIC_IP_PRI199_SHIFT                 0u
#define NVIC_IP_PRI199_WIDTH                 8u
#define NVIC_IP_PRI199(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI199_SHIFT))&NVIC_IP_PRI199_MASK)
#define NVIC_IP_PRI200_MASK                  0xFFu
#define NVIC_IP_PRI200_SHIFT                 0u
#define NVIC_IP_PRI200_WIDTH                 8u
#define NVIC_IP_PRI200(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI200_SHIFT))&NVIC_IP_PRI200_MASK)
#define NVIC_IP_PRI201_MASK                  0xFFu
#define NVIC_IP_PRI201_SHIFT                 0u
#define NVIC_IP_PRI201_WIDTH                 8u
#define NVIC_IP_PRI201(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI201_SHIFT))&NVIC_IP_PRI201_MASK)
#define NVIC_IP_PRI202_MASK                  0xFFu
#define NVIC_IP_PRI202_SHIFT                 0u
#define NVIC_IP_PRI202_WIDTH                 8u
#define NVIC_IP_PRI202(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI202_SHIFT))&NVIC_IP_PRI202_MASK)
#define NVIC_IP_PRI203_MASK                  0xFFu
#define NVIC_IP_PRI203_SHIFT                 0u
#define NVIC_IP_PRI203_WIDTH                 8u
#define NVIC_IP_PRI203(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI203_SHIFT))&NVIC_IP_PRI203_MASK)
#define NVIC_IP_PRI204_MASK                  0xFFu
#define NVIC_IP_PRI204_SHIFT                 0u
#define NVIC_IP_PRI204_WIDTH                 8u
#define NVIC_IP_PRI204(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI204_SHIFT))&NVIC_IP_PRI204_MASK)
#define NVIC_IP_PRI205_MASK                  0xFFu
#define NVIC_IP_PRI205_SHIFT                 0u
#define NVIC_IP_PRI205_WIDTH                 8u
#define NVIC_IP_PRI205(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI205_SHIFT))&NVIC_IP_PRI205_MASK)
#define NVIC_IP_PRI206_MASK                  0xFFu
#define NVIC_IP_PRI206_SHIFT                 0u
#define NVIC_IP_PRI206_WIDTH                 8u
#define NVIC_IP_PRI206(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI206_SHIFT))&NVIC_IP_PRI206_MASK)
#define NVIC_IP_PRI207_MASK                  0xFFu
#define NVIC_IP_PRI207_SHIFT                 0u
#define NVIC_IP_PRI207_WIDTH                 8u
#define NVIC_IP_PRI207(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI207_SHIFT))&NVIC_IP_PRI207_MASK)
#define NVIC_IP_PRI208_MASK                  0xFFu
#define NVIC_IP_PRI208_SHIFT                 0u
#define NVIC_IP_PRI208_WIDTH                 8u
#define NVIC_IP_PRI208(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI208_SHIFT))&NVIC_IP_PRI208_MASK)
#define NVIC_IP_PRI209_MASK                  0xFFu
#define NVIC_IP_PRI209_SHIFT                 0u
#define NVIC_IP_PRI209_WIDTH                 8u
#define NVIC_IP_PRI209(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI209_SHIFT))&NVIC_IP_PRI209_MASK)
#define NVIC_IP_PRI210_MASK                  0xFFu
#define NVIC_IP_PRI210_SHIFT                 0u
#define NVIC_IP_PRI210_WIDTH                 8u
#define NVIC_IP_PRI210(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI210_SHIFT))&NVIC_IP_PRI210_MASK)
#define NVIC_IP_PRI211_MASK                  0xFFu
#define NVIC_IP_PRI211_SHIFT                 0u
#define NVIC_IP_PRI211_WIDTH                 8u
#define NVIC_IP_PRI211(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI211_SHIFT))&NVIC_IP_PRI211_MASK)
#define NVIC_IP_PRI212_MASK                  0xFFu
#define NVIC_IP_PRI212_SHIFT                 0u
#define NVIC_IP_PRI212_WIDTH                 8u
#define NVIC_IP_PRI212(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI212_SHIFT))&NVIC_IP_PRI212_MASK)
#define NVIC_IP_PRI213_MASK                  0xFFu
#define NVIC_IP_PRI213_SHIFT                 0u
#define NVIC_IP_PRI213_WIDTH                 8u
#define NVIC_IP_PRI213(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI213_SHIFT))&NVIC_IP_PRI213_MASK)
#define NVIC_IP_PRI214_MASK                  0xFFu
#define NVIC_IP_PRI214_SHIFT                 0u
#define NVIC_IP_PRI214_WIDTH                 8u
#define NVIC_IP_PRI214(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI214_SHIFT))&NVIC_IP_PRI214_MASK)
#define NVIC_IP_PRI215_MASK                  0xFFu
#define NVIC_IP_PRI215_SHIFT                 0u
#define NVIC_IP_PRI215_WIDTH                 8u
#define NVIC_IP_PRI215(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI215_SHIFT))&NVIC_IP_PRI215_MASK)
#define NVIC_IP_PRI216_MASK                  0xFFu
#define NVIC_IP_PRI216_SHIFT                 0u
#define NVIC_IP_PRI216_WIDTH                 8u
#define NVIC_IP_PRI216(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI216_SHIFT))&NVIC_IP_PRI216_MASK)
#define NVIC_IP_PRI217_MASK                  0xFFu
#define NVIC_IP_PRI217_SHIFT                 0u
#define NVIC_IP_PRI217_WIDTH                 8u
#define NVIC_IP_PRI217(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI217_SHIFT))&NVIC_IP_PRI217_MASK)
#define NVIC_IP_PRI218_MASK                  0xFFu
#define NVIC_IP_PRI218_SHIFT                 0u
#define NVIC_IP_PRI218_WIDTH                 8u
#define NVIC_IP_PRI218(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI218_SHIFT))&NVIC_IP_PRI218_MASK)
#define NVIC_IP_PRI219_MASK                  0xFFu
#define NVIC_IP_PRI219_SHIFT                 0u
#define NVIC_IP_PRI219_WIDTH                 8u
#define NVIC_IP_PRI219(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI219_SHIFT))&NVIC_IP_PRI219_MASK)
#define NVIC_IP_PRI220_MASK                  0xFFu
#define NVIC_IP_PRI220_SHIFT                 0u
#define NVIC_IP_PRI220_WIDTH                 8u
#define NVIC_IP_PRI220(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI220_SHIFT))&NVIC_IP_PRI220_MASK)
#define NVIC_IP_PRI221_MASK                  0xFFu
#define NVIC_IP_PRI221_SHIFT                 0u
#define NVIC_IP_PRI221_WIDTH                 8u
#define NVIC_IP_PRI221(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI221_SHIFT))&NVIC_IP_PRI221_MASK)
#define NVIC_IP_PRI222_MASK                  0xFFu
#define NVIC_IP_PRI222_SHIFT                 0u
#define NVIC_IP_PRI222_WIDTH                 8u
#define NVIC_IP_PRI222(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI222_SHIFT))&NVIC_IP_PRI222_MASK)
#define NVIC_IP_PRI223_MASK                  0xFFu
#define NVIC_IP_PRI223_SHIFT                 0u
#define NVIC_IP_PRI223_WIDTH                 8u
#define NVIC_IP_PRI223(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI223_SHIFT))&NVIC_IP_PRI223_MASK)
#define NVIC_IP_PRI224_MASK                  0xFFu
#define NVIC_IP_PRI224_SHIFT                 0u
#define NVIC_IP_PRI224_WIDTH                 8u
#define NVIC_IP_PRI224(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI224_SHIFT))&NVIC_IP_PRI224_MASK)
#define NVIC_IP_PRI225_MASK                  0xFFu
#define NVIC_IP_PRI225_SHIFT                 0u
#define NVIC_IP_PRI225_WIDTH                 8u
#define NVIC_IP_PRI225(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI225_SHIFT))&NVIC_IP_PRI225_MASK)
#define NVIC_IP_PRI226_MASK                  0xFFu
#define NVIC_IP_PRI226_SHIFT                 0u
#define NVIC_IP_PRI226_WIDTH                 8u
#define NVIC_IP_PRI226(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI226_SHIFT))&NVIC_IP_PRI226_MASK)
#define NVIC_IP_PRI227_MASK                  0xFFu
#define NVIC_IP_PRI227_SHIFT                 0u
#define NVIC_IP_PRI227_WIDTH                 8u
#define NVIC_IP_PRI227(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI227_SHIFT))&NVIC_IP_PRI227_MASK)
#define NVIC_IP_PRI228_MASK                  0xFFu
#define NVIC_IP_PRI228_SHIFT                 0u
#define NVIC_IP_PRI228_WIDTH                 8u
#define NVIC_IP_PRI228(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI228_SHIFT))&NVIC_IP_PRI228_MASK)
#define NVIC_IP_PRI229_MASK                  0xFFu
#define NVIC_IP_PRI229_SHIFT                 0u
#define NVIC_IP_PRI229_WIDTH                 8u
#define NVIC_IP_PRI229(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI229_SHIFT))&NVIC_IP_PRI229_MASK)
#define NVIC_IP_PRI230_MASK                  0xFFu
#define NVIC_IP_PRI230_SHIFT                 0u
#define NVIC_IP_PRI230_WIDTH                 8u
#define NVIC_IP_PRI230(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI230_SHIFT))&NVIC_IP_PRI230_MASK)
#define NVIC_IP_PRI231_MASK                  0xFFu
#define NVIC_IP_PRI231_SHIFT                 0u
#define NVIC_IP_PRI231_WIDTH                 8u
#define NVIC_IP_PRI231(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI231_SHIFT))&NVIC_IP_PRI231_MASK)
#define NVIC_IP_PRI232_MASK                  0xFFu
#define NVIC_IP_PRI232_SHIFT                 0u
#define NVIC_IP_PRI232_WIDTH                 8u
#define NVIC_IP_PRI232(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI232_SHIFT))&NVIC_IP_PRI232_MASK)
#define NVIC_IP_PRI233_MASK                  0xFFu
#define NVIC_IP_PRI233_SHIFT                 0u
#define NVIC_IP_PRI233_WIDTH                 8u
#define NVIC_IP_PRI233(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI233_SHIFT))&NVIC_IP_PRI233_MASK)
#define NVIC_IP_PRI234_MASK                  0xFFu
#define NVIC_IP_PRI234_SHIFT                 0u
#define NVIC_IP_PRI234_WIDTH                 8u
#define NVIC_IP_PRI234(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI234_SHIFT))&NVIC_IP_PRI234_MASK)
#define NVIC_IP_PRI235_MASK                  0xFFu
#define NVIC_IP_PRI235_SHIFT                 0u
#define NVIC_IP_PRI235_WIDTH                 8u
#define NVIC_IP_PRI235(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI235_SHIFT))&NVIC_IP_PRI235_MASK)
#define NVIC_IP_PRI236_MASK                  0xFFu
#define NVIC_IP_PRI236_SHIFT                 0u
#define NVIC_IP_PRI236_WIDTH                 8u
#define NVIC_IP_PRI236(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI236_SHIFT))&NVIC_IP_PRI236_MASK)
#define NVIC_IP_PRI237_MASK                  0xFFu
#define NVIC_IP_PRI237_SHIFT                 0u
#define NVIC_IP_PRI237_WIDTH                 8u
#define NVIC_IP_PRI237(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI237_SHIFT))&NVIC_IP_PRI237_MASK)
#define NVIC_IP_PRI238_MASK                  0xFFu
#define NVIC_IP_PRI238_SHIFT                 0u
#define NVIC_IP_PRI238_WIDTH                 8u
#define NVIC_IP_PRI238(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI238_SHIFT))&NVIC_IP_PRI238_MASK)
#define NVIC_IP_PRI239_MASK                  0xFFu
#define NVIC_IP_PRI239_SHIFT                 0u
#define NVIC_IP_PRI239_WIDTH                 8u
#define NVIC_IP_PRI239(x)                    (((uint8_t)(((uint8_t)(x))<<NVIC_IP_PRI239_SHIFT))&NVIC_IP_PRI239_MASK)
/* STIR Bit Fields */
#define NVIC_STIR_INTID_MASK                 0x1FFu
#define NVIC_STIR_INTID_SHIFT                0u
#define NVIC_STIR_INTID_WIDTH                9u
#define NVIC_STIR_INTID(x)                   (((uint32_t)(((uint32_t)(x))<<NVIC_STIR_INTID_SHIFT))&NVIC_STIR_INTID_MASK)


#endif  /* HEADER_NVIC_H_ */
